{
	"ANIMATE_DEAD": {
		"name": "Animate Dead",
		"source": "Player's Handbook",
		"type": "NECROMANCY",
		"level": 3,
		"description": "<div><p>This spell creates an undead servant. Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a skeleton if you chose bones or a zombie if you chose a corpse (the DM has the creature’s game statistics).</p><p>On each of your turns, you can use a bonus action to mentally command any creature you made with this spell if the creature is within 60 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.</p><p>The creature is under your control for 24 hours, after which it stops obeying any command you’ve given it. To maintain the control of the creature for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends. This use of the spell reasserts your control over up to four creatures you have animated with this spell, rather than animating a new one.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, you animate or reassert control over two additional undead creatures for each slot level above 3rd. Each of the creatures must come from a different corpse or pile of bones.",
		"spellLists": "Cleric, Wizard",
		"castingTime": "1 minute",
		"range": "10 feet",
		"components": "V, S, M (a drop of blood, a piece of flesh, and a pinch of bone dust)",
		"duration": "Instantaneous"
	},
	"ANTAGONIZE_UA": {
		"name": "Antagonize (UA)",
		"source": "Unearthed Arcana 85 - Wonders of the Multiverse",
		"type": "ENCHANTMENT",
		"level": 3,
		"description": "<div><p>You whisper magical words that antagonize one creature of your choice within range. The target must make a Wisdom saving throw. On a failed save, it takes 4d4 psychic damage and must immediately use its reaction, if available, to make a melee attack against another creature of your choice that you can see. If no other creature is within range, the target has disadvantage on the next attack roll it makes before the start of your next turn.</p></div>",
		"higherLevels": ". When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d4 for each slot level above 3rd.",
		"spellLists": "Bard, Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "30 feet",
		"components": "V, S, M (a playing card depicting a rogue)",
		"duration": "Instantaneous"
	},
	"ASHARDALONS_STRIDE": {
		"name": "Ashardalon's Stride",
		"source": "Fizban's Treasury of Dragons",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>The billowing flames of a dragon blast from your feet, granting you explosive speed. For the duration, your speed increases by 20 feet and moving doesn’t provoke opportunity attacks.</p><p>When you move within 5 feet of a creature or an object that isn’t being worn or carried, it takes 1d6 fire damage from your trail of heat. A creature or object can take this damage only once during a turn.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, increase your speed by 5 feet for each spell slot level above 3rd. The spell deals an additional 1d6 fire damage for each slot level above 3rd.",
		"spellLists": "Artificer, Ranger, Sorcerer, Wizard",
		"castingTime": "1 bonus action",
		"range": "Self",
		"components": "V,S",
		"duration": "Concentration, up to 1 minute"
	},
	"AURA_OF_VITALITY": {
		"name": "Aura of Vitality",
		"source": "Player's Handbook",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>Healing energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. You can use a bonus action to cause one creature in the aura (including you) to regain 2d6 hit points.</p></div>",
		"spellLists": "Cleric (Optional), Druid (Optional), Paladin",
		"castingTime": "1 action",
		"range": "Self (30-foot radius)",
		"components": "V",
		"duration": "Concentration, up to 1 minute"
	},
	"BEACON_OF_HOPE": {
		"name": "Beacon of Hope",
		"source": "Player's Handbook",
		"type": "ABJURATION",
		"level": 3,
		"description": "<div><p>This spell bestows hope and vitality. Choose any number of creatures within range. For the duration, each target has advantage on Wisdom saving throws and death saving throws, and regains the maximum number of hit points possible from any healing.</p></div>",
		"spellLists": "Cleric",
		"castingTime": "1 action",
		"range": "30 feet",
		"components": "V, S",
		"duration": "Concentration, up to 1 minute"
	},
	"BESTOW_CURSE": {
		"name": "Bestow Curse",
		"source": "Player's Handbook",
		"type": "NECROMANCY",
		"level": 3,
		"description": "<div><p>You touch a creature, and that creature must succeed on a Wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options:</p><ul><li>Choose one ability score. While cursed, the target has disadvantage on ability checks and saving throws made with that ability score.</li></ul><ul><li>While cursed, the target has disadvantage on attack rolls against you.</li></ul><ul><li>While cursed, the target must make a Wisdom saving throw at the start of each of its turns. If it fails, it wastes its action that turn doing nothing.</li></ul><ul><li>While the target is cursed, your attacks and spells deal an extra 1d8 necrotic damage to the target.</li></ul><p>A <em><a href=\"/spell:remove-curse\">remove curse</a></em> spell ends this effect. At the DM's option, you may choose an alternative curse effect, but it should be no more powerful than those described above. The DM has final say on such a curse's effect.</p></div>",
		"higherLevels": "If you cast this spell using a spell slot of 4th level or higher, the duration is concentration, up to 10 minutes. If you use a spell slot of 5th level or higher, the duration is 8 hours. If you use a spell slot of 7th level or higher, the duration is 24 hours. If you use a 9th level spell slot, the spell lasts until it is dispelled. Using a spell slot of 5th level or higher grants a duration that doesn't require concentration.",
		"spellLists": "Bard, Cleric, Wizard",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, S",
		"duration": "Concentration, up to 1 minute"
	},
	"BLINDING_SMITE": {
		"name": "Blinding Smite",
		"source": "Player's Handbook",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>The next time you hit a creature with a melee weapon attack during this spell’s duration, you weapon flares with a bright light, and the attack deals an extra 3d8 radiant damage to the target. Additionally, the target must succeed on a Constitution saving throw or be blinded until the spell ends.</p><p>A creature blinded by this spell makes another Constitution saving throw at the end of each of its turns. On a successful save, it is no longer blinded.</p></div>",
		"spellLists": "Paladin",
		"castingTime": "1 bonus action",
		"range": "Self",
		"components": "V",
		"duration": "Concentration, up to 1 minute"
	},
	"BLINK": {
		"name": "Blink",
		"source": "Player's Handbook",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>Roll a d20 at the end of each of your turns for the duration of the spell. On a roll of 11 or higher, you vanish from your current plane of existence and appear in the Ethereal Plane (the spell fails and the casting is wasted if you were already on that plane).</p><p>At the start of you next turn, and when the spell ends if you are on the Ethereal Plane, you return to an unoccupied space of your choice that you can see within 10 feet of the space you vanished from. If no unoccupied space is available within that range, you appear in the nearest unoccupied space (chosen at random if more that one space is equally near). You can dismiss this spell as an action.</p><p>While on the Ethereal Plane, you can see and hear the plane you originated from, which is cast in shades of gray, and you can’t see anything more than 60 feet away. You can only affect and be affected by other creatures on the Ethereal Plane. Creature that aren’t there can’t perceive you or interact with you, unless they have the ability to do so.</p></div>",
		"spellLists": "Artificer, Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "Self",
		"components": "V, S",
		"duration": "1 minute"
	},
	"CALL_LIGHTNING": {
		"name": "Call Lightning",
		"source": "Player's Handbook",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>A storm cloud appears in the shape of a cylinder that is 10 feet tall with a 60-foot radius, centered on a point you can see within range directly above you. The spell fails if you can’t see a point in the air where the storm cloud could appear (for example, if you are in a room that can’t accommodate the cloud).</p><p>When you cast the spell, choose a point you can see under the cloud. A bolt of lightning flashes down from the cloud to that point. Each creature within 5 feet of that point must make a Dexterity saving throw. A creature takes 3d10 lightning damage on a failed save, or half as much damage on a successful one. On each of your turns until the spell ends, you can use your action to call down lightning in this way again, targeting the same point or a different one.</p><p>If you are outdoors in stormy conditions when you cast this spell, the spell gives you control over the existing storm instead of creating a new one. Under such conditions, the spell’s damage increases by 1d10.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th or higher level, the damage increases by 1d10 for each slot level above 3rd.",
		"spellLists": "Druid",
		"castingTime": "1 action",
		"range": "120 feet",
		"components": "V, S",
		"duration": "Concentration, up to 10 minutes"
	},
	"CATNAP": {
		"name": "Catnap",
		"source": "Xanathar's Guide to Everything",
		"type": "ENCHANTMENT",
		"level": 3,
		"description": "<div><p>You make a calming gesture, and up to three willing creatures of your choice that you can see within range fall unconscious for the spell’s duration. The spell ends on a target early if it takes damage or someone uses an action to shake or slap it awake. If a target remains unconscious for the full duration, that target gains the benefit of a short rest, and it can’t be affected by this spell again until it finishes a long rest.</p></div>",
		"spellLists": "Artificer, Bard, Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "30 feet",
		"components": "S, M (a pinch of sand)",
		"duration": "10 minutes"
	},
	"CLAIRVOYANCE": {
		"name": "Clairvoyance",
		"source": "Player's Handbook",
		"type": "DIVINATION",
		"level": 3,
		"description": "<div><p>You create an invisible sensor within range in a location familiar to you (a place you have visited or seen before) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees). The sensor remains in place for the duration, and it can’t be attacked or otherwise interacted with.</p><p>When you cast the spell, you choose seeing or hearing. You can use the chosen sense through the sensor as if you were in its space. As your action, you can switch between seeing and hearing. A creature that can see the sensor (such as a creature benefitting from see invisibility or truesight) sees a luminous, intangible orb about the size of your fist.</p></div>",
		"spellLists": "Bard, Cleric, Sorcerer, Wizard",
		"castingTime": "10 minutes",
		"range": "1 mile",
		"components": "V, S, M (a focus worth at least 100 gp, either a jeweled horn for hearing or a glass eye for seeing)",
		"duration": "Concentration, up to 10 minutes"
	},
	"CONJURE_ANIMALS": {
		"name": "Conjure Animals",
		"source": "Player's Handbook",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You summon fey spirits that take the form of beasts and appear in unoccupied spaces that you can see within range.</p><p>Choose one of the following options for what appears:</p><ul><li>One beast of challenge rating 2 or lower</li></ul><ul><li>Two beasts of challenge rating 1 or lower</li></ul><ul><li>Four beasts of challenge rating 1/2 or lower</li></ul><ul><li>Eight beasts of challenge rating 1/4 or lower</li></ul><p>Each beast is also considered fey, and it disappears when it drops to 0 hit points or when the spell ends.</p><p>The summoned creatures are friendly to you and your companions. Roll initiative for the summoned creatures as a group, which has its own turns. They obey any verbal commands that you issue to them (no action required by you). If you don’t issue any commands to them, they defend themselves from hostile creatures, but otherwise take no actions. The DM has the creatures’ statistics.</p></div>",
		"higherLevels": "When you cast this spell using certain higher-level spell slots, you choose one of the summoning options above, and more creatures appear: twice as many with a 5th-level slot, three times as many with a 7th-level slot, and four times as many with a 9th-level slot.",
		"spellLists": "Druid, Ranger",
		"castingTime": "1 action",
		"range": "60 feet",
		"components": "V, S",
		"duration": "Concentration, up to 1 hour"
	},
	"CONJURE_BARRAGE": {
		"name": "Conjure Barrage",
		"source": "Player's Handbook",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You throw a nonmagical weapon or fire a piece of nonmagical ammunition into the air to create a cone of identical weapons that shoot forward and then disappear. Each creature in a 60-foot cone must succeed on a Dexterity saving throw. A creature takes 3d8 damage on a failed save, or half as much damage on a successful one. The damage type is the same as that of the weapon or ammunition used as a component.</p></div>",
		"spellLists": "Ranger",
		"castingTime": "1 action",
		"range": "Self (60-foot cone)",
		"components": "V, S, M (one piece of ammunition or a thrown weapon)",
		"duration": "Instantaneous"
	},
	"CONJURE_LESSER_DEMON": {
		"name": "Conjure Lesser Demon (UA)",
		"source": "Unearthed Arcana 11 - That Old Black Magic",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You summon up to a total of eight manes or dretches that appear in unoccupied spaces you can see within range. A manes or dretch disappears when it drops to 0 hit points or when the spell ends.</p><p>The demons are hostile to all creatures. Roll initiative for the summoned demons as a group, which has its own turns. The demons attack the nearest non-demons to the best of their ability.</p><p>As part of casting the spell, you can scribe a circle on the ground with the blood used as a material component. The circle is large enough to encompass your space. The summoned demons cannot cross the circle or target anyone in it while the spell lasts. Using the material component in this manner consumes it.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 6th or 7th level, you summon sixteen demons. If you cast it using a spell slot of 8th or 9th level, you summon thirty-two demons.",
		"spellLists": "Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "60 feet",
		"components": "V, S, M (a vial of blood from an intelligent humanoid killed within the past 24 hours)",
		"duration": "Concentration, up to 1 hour"
	},
	"COUNTERSPELL": {
		"name": "Counterspell",
		"source": "Player's Handbook",
		"type": "ABJURATION",
		"level": 3,
		"description": "<div><p>You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell’s level. On a success, the creature’s spell fails and has no effect.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used.",
		"spellLists": "Sorcerer, Warlock, Wizard",
		"castingTime": "1 reaction, which you take when you see a creature within 60 feet of you casting a spell",
		"range": "60 feet",
		"components": "S",
		"duration": "Instantaneous"
	},
	"CREATE_FOOD_AND_WATER": {
		"name": "Create Food and Water",
		"source": "Player's Handbook",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You create 45 pounds of food and 30 gallons of water on the ground or in containers within range, enough to sustain up to fifteen humanoids or five steeds for 24 hours. The food is bland but nourishing, and spoils if uneaten after 24 hours. The water is clean and doesn’t go bad.</p></div>",
		"spellLists": "Artificer, Cleric, Paladin",
		"castingTime": "1 action",
		"range": "30 feet",
		"components": "V, S",
		"duration": "Instantaneous"
	},
	"CRUSADERS_MANTLE": {
		"name": "Crusader's Mantle",
		"source": "Player's Handbook",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>Holy power radiates from you in an aura with a 30-foot radius, awakening boldness in friendly creatures. Until the spell ends, the aura moves with you, centered on you. While in the aura, each non-hostile creature in the aura (including you) deals an extra 1d4 radiant damage when it hits with a weapon attack.</p></div>",
		"spellLists": "Paladin",
		"castingTime": "1 action",
		"range": "Self",
		"components": "V",
		"duration": "Concentration, up to 1 minute"
	},
	"DAYLIGHT": {
		"name": "Daylight",
		"source": "Player's Handbook",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>A 60-foot-radius sphere of light spreads out from a point you choose within range. The sphere is bright light and sheds dim light for an additional 60 feet.</p><p>If you chose a point on an object you are holding or one that isn’t being worn or carried, the light shines from the object with and moves with it. Completely covering the affected object with an opaque object, such as a bowl or a helm, blocks the light.</p><p>If any of this spell’s area overlaps with an area of darkness created by a spell of 3rd level or lower, the spell that created the darkness is dispelled.</p></div>",
		"spellLists": "Cleric, Druid, Paladin, Ranger, Sorcerer",
		"castingTime": "1 action",
		"range": "60 feet",
		"components": "V, S",
		"duration": "1 hour"
	},
	"DISPEL_MAGIC": {
		"name": "Dispel Magic",
		"source": "Player's Handbook",
		"type": "ABJURATION",
		"level": 3,
		"description": "<div><p>Choose any creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, you automatically end the effects of a spell on the target if the spell's level is equal to or less than the level of the spell slot you used.",
		"spellLists": "Artificer, Bard, Cleric, Druid, Paladin, Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "120 feet",
		"components": "V, S",
		"duration": "Instantaneous"
	},
	"ELEMENTAL_WEAPON": {
		"name": "Elemental Weapon",
		"source": "Player's Handbook",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>A nonmagical weapon you touch becomes a magic weapon. Choose one of the following damage types: acid, cold, fire, lightning, or thunder. For the duration, the weapon has a +1 bonus to attack rolls and deals an extra 1d4 damage of the chosen type when it hits.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 5th or 6th level, the bonus to attack rolls increases to +2 and the extra damage increases to 2d4. When you use a spell slot of 7th level or higher, the bonus increases to +3 and the extra damage increases to 3d4.",
		"spellLists": "Artificer, Druid (Optional), Paladin, Ranger (Optional)",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, S",
		"duration": "Concentration, up to 1 hour"
	},
	"ENEMIES_ABOUND": {
		"name": "Enemies Abound",
		"source": "Xanathar's Guide to Everything",
		"type": "ENCHANTMENT",
		"level": 3,
		"description": "<div><p>You reach into the mind of one creature you can see and force it to make an Intelligence saving throw. A creature automatically succeeds if it is immune to being frightened. On a failed save, the target loses the ability to distinguish friend from foe, regarding all creatures it can see as enemies until the spell ends. Each time the target takes damage, it can repeat the saving throw, ending the effect on itself on a success.</p><p>Whenever the affected creature chooses another creature as a target, it must choose the target at random from among the creatures it can see within range of the attack, spell, or other ability it’s using. If an enemy provokes an opportunity attack from the affected creature, the creature must make that attack if it is able to.</p></div>",
		"spellLists": "Bard, Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "120 feet",
		"components": "V, S",
		"duration": "Concentration, up to 1 minute"
	},
	"ERUPTING_EARTH": {
		"name": "Erupting Earth",
		"source": "Xanathar's Guide to Everything/Elemental Evil Player's Companion",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>Choose a point you can see on the ground within range. A fountain of churned earth and stone erupts in a 20-foot cube centered on that point. Each creature in that area must make a Dexterity saving throw. A creature takes 3d12 bludgeoning damage on a failed save, or half as much damage on a successful one. Additionally, the ground in that area becomes difficult terrain until cleared away. Each 5-foot-square portion of the area requires at least 1 minute to clear by hand.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d12 for each slot level above 3rd.",
		"spellLists": "Druid, Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "120 feet",
		"components": "V, S, M (a piece of obsidian)",
		"duration": "Instantaneous"
	},
	"FAST_FRIENDS": {
		"name": "Fast Friends",
		"source": "Acquisitions Inc.",
		"type": "ENCHANTMENT",
		"level": 3,
		"description": "<div><p>When you cast this spell, choose one humanoid within range that can see and hear you, and that can understand you. The creature must succeed on a Wisdom saving throw or become charmed by you for the duration. While the creature is charmed in this way, it undertakes to perform any services or activities you ask of it in a friendly manner, to the best of its ability.</p><p>You can set the creature new tasks when a previous task is completed, or if you decide to end its current task. If the service or activity might cause harm to the creature, or if it conflicts with the creature's normal activities and desires, the creature can make another Wisdom saving throw to try to end the effect. This save is made with advantage if you or your companions are fighting the creature. If the activity would result in certain death for the creature, the spell ends.</p><p>When the spell ends, the creature knows it was charmed by you.</p><p><strong><em>At Higher Levels:</em></strong> When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd.</p><p><strong><em>Spell Lists:</em></strong> <a href=\"http://dnd5e.wikidot.com/spells:bard\">Bard</a>, <a href=\"http://dnd5e.wikidot.com/spells:cleric\">Cleric</a>, <a href=\"http://dnd5e.wikidot.com/spells:wizard\">Wizard</a></p></div>",
		"castingTime": "1 action",
		"range": "30 feet",
		"components": "V",
		"duration": "Concentration, up to 1 hour"
	},
	"FEAR": {
		"name": "Fear",
		"source": "Player's Handbook",
		"type": "ILLUSION",
		"level": 3,
		"description": "<div><p>You project a phantasmal image of a creature’s worst fears. Each creature in a 30-foot cone must succeed on a Wisdom saving throw or drop whatever it is holding and become frightened for the duration.</p><p>While frightened by this spell, a creature must take the Dash action and move away from you by the safest available route on each of its turns, unless there is nowhere to move. If the creature ends its turn in a location where it doesn’t have line of sight to you, the creature can make a Wisdom saving throw. On a successful save, the spell ends for that creature.</p></div>",
		"spellLists": "Bard, Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "Self (30-foot cone)",
		"components": "V, S, M (a white feather or the heart of a hen)",
		"duration": "Concentration, up to 1 minute"
	},
	"FEIGN_DEATH": {
		"name": "Feign Death",
		"source": "Player's Handbook",
		"type": "NECROMANCY",
		"level": 3,
		"description": "<div><p>You touch a willing creature and put it into a cataleptic state that is indistinguishable from death.</p><p>For the spell’s duration, or until you use an action to touch the target and dismiss the spell, the target appears dead to all outward inspection and to spells used to determine the target’s status. The target is blinded and incapacitated, and its speed drops to 0. The target has resistance to all damage except psychic damage. If the target is diseased or poisoned when you cast the spell, or becomes diseased or poisoned while under the spell’s effect, the disease and poison have no effect until the spell ends.</p></div>",
		"spellLists": "Bard, Cleric, Druid, Wizard",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, S, M (a pinch of graveyard dirt)",
		"duration": "1 hour"
	},
	"FIREBALL": {
		"name": "Fireball",
		"source": "Player's Handbook",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>A bright streak flashes from your pointing finger to a point you choose within range then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot radius must make a Dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one. The fire spreads around corners. It ignites flammable objects in the area that aren’t being worn or carried.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.",
		"spellLists": "Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "150 feet",
		"components": "V, S, M (a tiny ball of bat guano and sulfur)",
		"duration": "Instantaneous"
	},
	"FLAME_ARROWS": {
		"name": "Flame Arrows",
		"source": "Xanathar's Guide to Everything",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>You touch a quiver containing arrows or bolts. When a target is hit by a ranged weapon attack using a piece of ammunition drawn from the quiver, the target takes an extra 1d6 fire damage. The spell’s magic ends on the piece of ammunition when it hits or misses, and the spell ends when twelve pieces of ammunition have been drawn from the quiver.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the number of pieces of ammunition you can affect with this spell increases by two for each slot level above 3rd.",
		"spellLists": "Druid, Ranger, Sorcerer, Wizard, Artificer",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, S",
		"duration": "Concentration, up to 1 hour"
	},
	"FLAME_STRIDE": {
		"name": "Flame Stride (UA)",
		"source": "Unearthed Arcana 78 - Draconic Options",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>The billowing flames of a dragon cover your feet, granting you explosive speed. For the duration, your speed increases by 20 feet and moving doesn’t provoke opportunity attacks. When you move within 5 feet of a creature or object that isn’t being worn or carried, it takes 1d6 fire damage from your trail of heat. A creature or object can take this damage only once during a turn.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, increase your speed by 5 feet for each spell slot level above 3rd. Additionally, the spell deals an additional 1d6 fire damage for each slot level above 3rd.",
		"spellLists": "Artificer, Ranger, Sorcerer, Wizard",
		"castingTime": "1 bonus action",
		"range": "Self",
		"components": "V, S",
		"duration": "Concentration, up to 1 minute"
	},
	"FLY": {
		"name": "Fly",
		"source": "Player's Handbook",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>You touch a willing creature. The target gains a flying speed of 60 feet for the duration. When the spell ends, the target falls if it is still aloft, unless it can stop the fall.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd.",
		"spellLists": "Artificer, Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, S, M (a wing feather from any bird)",
		"duration": "Concentration, up to 10 minutes"
	},
	"FREEDOM_OF_THE_WAVES": {
		"name": "Freedom of the Waves (HB)",
		"source": "Tal'Dorei Campaign Setting Reborn",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You conjure a deluge of seawater in a 15-foot-radius, 10-foot-tall cylinder centered on a point within range. This water takes the form of a tidal wave, a whirlpool, a waterspout, or another form of your choice. Each creature in the area must succeed on a Strength saving throw against your spell save DC or take 2d8 bludgeoning damage and fall prone. You can choose a number of creatures equal to your spellcasting modifier (minimum of 1) to automatically succeed on this saving throw.</p><p>If you are within the spell’s area, as part of the action you use to cast the spell, you can vanish into the deluge and teleport to an unoccupied space that you can see within the spell’s area.</p></div>",
		"spellLists": "Druid, Ranger, Sorcerer",
		"castingTime": "1 action",
		"range": "120 feet",
		"components": "V, S, M (a strand of wet hair)",
		"duration": "Instantaneous"
	},
	"GALDERS_TOWER": {
		"name": "Galder's Tower",
		"source": "Lost Laboratory of Kwalish",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You conjure a two-story tower made of stone, wood, or similar suitably sturdy materials. The tower can be round or square in shape. Each level of the tower is 10 feet tall and has an area of up to 100 square feet. Access between levels consists of a simple ladder and hatch. Each level takes one of the following forms, chosen by you when you cast the spell:</p><ul><li>A bedroom with a bed, chairs, chest, and magical fireplace</li></ul><ul><li>A study with desks, books, bookshelves, parchments, ink, and ink pens</li></ul><ul><li>A dining space with a table, chairs, magical fireplace, containers, and cooking utensils</li></ul><ul><li>A lounge with couches, armchairs, side tables and footstools</li></ul><ul><li>A washroom with toilets, washtubs, a magical brazier, and sauna benches</li></ul><ul><li>An observatory with a telescope and maps of the night sky</li></ul><ul><li>An unfurnished, empty room</li></ul><p>The interior of the tower is warm and dry, regardless of conditions outside. Any equipment or furnishings conjured with the tower dissipate into smoke if removed from it. At the end of the spell’s duration, all creatures and objects within the tower that were not created by the spell appear safely outside on the ground, and all traces of the tower and its furnishings disappear.</p><p>You can cast this spell again while it is active to maintain the tower’s existence for another 24 hours. You can create a permanent tower by casting this spell in the same location and with the same configuration every day for one year.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the tower can have one additional story for each slot level beyond 3rd.",
		"spellLists": "Wizard",
		"castingTime": "10 minutes",
		"range": "30 feet",
		"components": "V, S, M (a fragment of stone, wood, or other building material)",
		"duration": "24 hours"
	},
	"GASEOUS_FORM": {
		"name": "Gaseous Form",
		"source": "Player's Handbook",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>You transform a willing creature you touch, along with everything it’s wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. An incorporeal creature isn’t affected.</p><p>While in this form, the target’s only method of movement is a flying speed of 10 feet. The target can enter and occupy the space of another creature. The target has resistance to nonmagical damage, and it has advantage on Strength, Dexterity, and Constitution saving throws. The target can pass through small holes, narrow openings, and even mere cracks, though it treats liquids as though they were solid surfaces. The target can’t fall and remains hovering in the air even when stunned or otherwise incapacitated.</p><p>While in the form of a misty cloud, the target can’t talk or manipulate objects, and any objects it was carrying or holding can’t be dropped, used, or otherwise interacted with. The target can’t attack or cast spells.</p></div>",
		"spellLists": "Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, S, M (a bit of gauze and a wisp of smoke)",
		"duration": "Concentration, up to 1 hour"
	},
	"GLYPH_OF_WARDING": {
		"name": "Glyph of Warding",
		"source": "Player's Handbook",
		"type": "ABJURATION",
		"level": 3,
		"description": "<div><p>When you cast this spell, you inscribe a glyph that creates a magical effect triggered by other creatures, either upon a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph. The glyph can cover an area no larger than 10 feet in diameter. If the surface or object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered.</p><p>The glyph is nearly invisible and requires a successful Intelligence (Investigation) check against your spell save DC to be found.</p><p>You decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or standing on the glyph, removing another object covering the glyph, approaching within a certain distance of the glyph, or manipulating the object on which the glyph is inscribed. For glyphs inscribed within an object, the most common triggers include opening that object, approaching within a certain distance of the object, or seeing or reading the glyph. Once a glyph is triggered, this spell ends.</p><p>You can further refine the trigger so the spell activates only under certain circumstances or according to physical characteristics (such as height or weight), creature kind (for example, the ward could be set to affect aberrations or drow), or alignment. You can also set conditions for creatures that don’t trigger the glyph, such as those who say a certain password.</p><p>When you inscribe the glyph, choose explosive runes or a spell glyph.</p><p><strong><em>Explosive Runes.</em></strong> When triggered, the glyph erupts with magical energy in a 20-foot-radius sphere centered on the glyph. The sphere spreads around corners. Each creature in the area must make a Dexterity saving throw. A creature takes 5d8 acid, cold, fire, lightning, or thunder damage on a failed saving throw (your choice when you create the glyph), or half as much damage on a successful one.</p><p><strong><em>Spell Glyph.</em></strong> You can store a prepared spell of 3rd level or lower in the glyph by casting it as part of creating the glyph. The spell must target a single creature or an area. The spell being stored has no immediate effect when cast in this way. When the glyph is triggered, the stored spell is cast. If the spell has a target, it targets the creature that triggered the glyph. If the spell affects an area, the area is centered on that creature. If the spell summons hostile creatures or creates harmful objects or traps, they appear as close as possible to the intruder and attack it. If the spell requires concentration, it lasts until the end of its full duration.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage of an explosive runes glyph increases by 1d8 for each slot level above 3rd. If you create a spell glyph, you can store any spell of up to the same level as the slot you use for the glyph of warding.",
		"spellLists": "Artificer, Bard, Cleric, Wizard",
		"castingTime": "1 hour",
		"range": "Touch",
		"components": "V, S, M (incense and powdered diamond worth at least 200 gp, which the spell consumes)",
		"duration": "Until dispelled or triggered"
	},
	"HASTE": {
		"name": "Haste",
		"source": "Player's Handbook",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>Choose a willing creature that you can see within range. Until the spell ends, the target’s speed is doubled, it gains a +2 bonus to AC, it has advantage on Dexterity saving throws, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.</p><p>When the spell ends, the target can’t move or take actions until after its next turn, as a wave of lethargy sweeps over it.</p></div>",
		"spellLists": "Artificer, Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "30 feet",
		"components": "V, S, M (a shaving of licorice root)",
		"duration": "Concentration, up to 1 minute"
	},
	"HAYWIRE": {
		"name": "Haywire (UA)",
		"source": "Unearthed Arcana 7 - Modern Magic",
		"type": "ENCHANTMENT",
		"level": 3,
		"description": "<div><p>This spell plays havoc with electronic devices, making the use of such devices all but impossible. Each electronic device in a 10-foot-radius sphere centered on a point you choose within range is subject to random behavior while it remains within the area. A device not held by a creature is automatically affected. If an electronic device is held by a creature, that creature must succeed on a Wisdom saving throw or have the device affected by the spell.</p><p>At the start of each of your turns, roll a d6 for each affected device to determine its behavior. Except where otherwise indicated, that behavior lasts until the start of your next turn while this spell is in effect.</p><table><tbody><tr><th>d6</th><th>Effect</th></tr><tr><td>1</td><td>The device shuts down and must be restarted. Do not roll again for this device until it is restarted.</td></tr><tr><td>2-4</td><td>The device does not function.</td></tr><tr><td>5</td><td>The device experiences a power surge, causing an electric shock to the wielder (if any and one random creature within 5 feet of the device. Each affected creature must make a Dexterity saving throw against your spell save DC, taking 6d6 lightning damage on a failed save, or half as much damage on a successful one.</td></tr><tr><td>6</td><td>The device is usable as normal.</td></tr></tbody></table></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the radius of the sphere affected by the spell increases by 5 feet for each slot level above 3rd.",
		"spellLists": "Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "90 feet",
		"components": "V, S",
		"duration": "Concentration, up to 1 minute"
	},
	"HOUSE_OF_CARDS_UA": {
		"name": "House of Cards (UA)",
		"source": "Unearthed Arcana 85 - Wonders of the Multiverse",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You touch the ground and conjure forth a defensive structure made of enormous playing cards. The structure rises with you at its center, harmlessly lifting you and any creatures in the area. The house of cards has a square base that is 30 feet on each side, and it has three floors with 10-foot-high ceilings. The second floor is 20 feet on each side, and the top floor is 10 feet on each side—both centered above the bottom floor. Ramps connect the interior of each floor, and empty doorframes connect the interior and exterior of each level. Creatures inside or on top of the structure have half cover.</p><p>Each card that comprises the house is 5 feet wide and 10 feet tall and is very fragile. A card has AC 10 and 1 hit point. The cards are immune to poison and psychic damage. Reducing a card to 0 hit points destroys it. Every time a card is destroyed, roll 1d6. If you roll a 5 or a 6, the house collapses, ending the spell.</p><p>The house and all its cards vanish when the spell ends.</p></div>",
		"spellLists": "Artificer, Bard, Sorcerer, Wizard",
		"castingTime": "1 minute",
		"range": "Touch",
		"components": "V, S, M (a deck of cards)",
		"duration": "24 hours"
	},
	"HUNGER_OF_HADAR": {
		"name": "Hunger Of Hadar",
		"source": "Player's Handbook",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You open a gateway to the dark between the stars, a region infested with unknown horrors. A 20-foot-radius sphere of blackness and bitter cold appears, centered on a point with range and lasting for the duration. This void is filled with a cacophony of soft whispers and slurping noises that can be heard up to 30 feet away. No light, magical or otherwise, can illuminate the area, and creatures fully within the area are blinded.</p><p>The void creates a warp in the fabric of space, and the area is difficult terrain. Any creature that starts its turn in the area takes 2d6 cold damage. Any creature that ends its turn in the area must succeed on a Dexterity saving throw or take 2d6 acid damage as milky, otherwordly tentacles rub against it.</p></div>",
		"spellLists": "Warlock",
		"castingTime": "1 action",
		"range": "150 feet",
		"components": "V, S, M (a pickled octopus tentacle)",
		"duration": "Concentration, up to 1 minute"
	},
	"HYPNOTIC_PATTERN": {
		"name": "Hypnotic Pattern",
		"source": "Player's Handbook",
		"type": "ILLUSION",
		"level": 3,
		"description": "<div><p>You create a twisting pattern of colors that weaves through the air inside a 30-foot cube within range. The pattern appears for a moment and vanishes. Each creature in the area who sees the pattern must make a Wisdom saving throw. On a failed save, the creature becomes charmed for the duration. While charmed by this spell, the creature is incapacitated and has a speed of 0.</p><p>The spell ends for an affected creature if it takes any damage or if someone else uses an action to shake the creature out of its stupor.</p></div>",
		"spellLists": "Bard, Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "120 feet",
		"components": "S, M (a glowing stick of incense or a crystal vial filled with phosphorescent material)",
		"duration": "Concentration, up to 1 minute"
	},
	"INCITE_GREED": {
		"name": "Incite Greed",
		"source": "Acquisitions Inc.",
		"type": "ENCHANTMENT",
		"level": 3,
		"description": "<div><p>When you cast this spell, you present the gem used as the material component and choose any number of creatures within range that can see you. Each target must succeed on a Wisdom saving throw or be charmed by you until the spell ends, or until you or your companions do anything harmful to it. While charmed in this way, a creature can do nothing but use its movement to approach you in a safe manner. While an affected creature is within 5 feel of you, it cannot move, but simply stares greedily at the gem you present.</p><p>At the end of each of its turns, an affected target can make a Wisdom saving throw. If it succeeds, this effect ends for that target.</p></div>",
		"spellLists": "Cleric, Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "30 feet",
		"components": "V, S, M (a gem worth at least 50 gp)",
		"duration": "Concentration, up to 1 minute"
	},
	"INTELLECT_FORTRESS": {
		"name": "Intellect Fortress",
		"source": "Tasha's Cauldron of Everything",
		"type": "ABJURATION",
		"level": 3,
		"description": "<div><p>For the duration, you or one willing creature you can see within range has resistance to psychic damage, as well as advantage on Intelligence, Wisdom, and Charisma saving throws.</p><p><strong><em>At Higher Levels.</em></strong> When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd. The creatures must be within 30 feet of each other when you target them.</p><p><strong><em>Spell Lists:</em></strong> <a href=\"http://dnd5e.wikidot.com/spells:artificer\">Artificer</a>, <a href=\"/spells:bard\">Bard (Optional)</a>, <a href=\"/spells:sorcerer\">Sorcerer (Optional)</a>, <a href=\"/spells:warlock\">Warlock (Optional)</a>, <a href=\"/spells:wizard\">Wizard (Optional)</a></p></div>",
		"castingTime": "1 action",
		"range": "30 feet",
		"components": "V",
		"duration": "Concentration, up to 1 hour"
	},
	"INVISIBILITY_TO_CAMERAS": {
		"name": "Invisibility To Cameras (UA)",
		"source": "Unearthed Arcana 7 - Modern Magic",
		"type": "ILLUSION",
		"level": 3,
		"description": "<div><p>Four creatures of your choice within range become undetectable to electronic sensors and cameras for the duration of the spell. Anything a target is wearing or carrying is likewise undetectable as long as it is on the target’s person. The targets remain visible to vision.</p></div>",
		"spellLists": "Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "10 feet",
		"components": "V, S, M (a scrap of black paper)",
		"duration": "Concentration, up to 1 minute"
	},
	"LEOMUNDS_TINY_HUT": {
		"name": "Leomund's Tiny Hut",
		"source": "Player's Handbook",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>A 10-foot-radius immobile dome of force springs into existence around and above you and remains stationary for the duration. The spell ends if you leave its area.</p><p>Nine creatures of Medium size or smaller can fit inside the dome with you. The spell fails if its area includes a larger creature or more than nine creatures. Creatures and objects within the dome when you cast this spell can move through it freely. All other creatures and objects are barred from passing through it. Spells and other magical effects can't extend through the dome or be cast through it. The atmosphere inside the space is comfortable and dry, regardless of the weather outside.</p><p>Until the spell ends, you can command the interior to become dimly lit or dark. The dome is opaque from the outside, of any color you choose, but it is transparent from the inside.</p></div>",
		"spellLists": "Bard, Wizard",
		"castingTime": "1 minute",
		"range": "Self (10-foot-radius hemisphere)",
		"components": "V, S, M (a small crystal bead)",
		"duration": "8 hours"
	},
	"LIFE_TRANSFERENCE": {
		"name": "Life Transference",
		"source": "Xanathar's Guide to Everything",
		"type": "NECROMANCY",
		"level": 3,
		"description": "<div><p>You sacrifice some of your health to mend another creature’s injuries. You take 4d8 necrotic damage, which can’t be reduced in any way, and one creature of your choice that you can see within range regains a number of hit points equal to twice the necrotic damage you take.</p><p><strong><em>At Higher Levels:</em></strong> When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.</p><p><strong><em>Spell Lists:</em></strong> <a href=\"http://dnd5e.wikidot.com/spells:cleric\">Cleric</a>, <a href=\"http://dnd5e.wikidot.com/spells:wizard\">Wizard</a></p></div>",
		"castingTime": "1 action",
		"range": "30 feet",
		"components": "V, S",
		"duration": "Instantaneous"
	},
	"LIGHTNING_ARROW": {
		"name": "Lightning Arrow",
		"source": "Player's Handbook",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>The next time you make a ranged weapon attack during the spell’s duration, the weapon’s ammunition, or the weapon itself if it’s a thrown weapon, transforms into a bolt of lightning. Make the attack roll as normal. The target takes 4d8 lightning damage on a hit, or half as much damage on a miss, instead of the weapon’s normal damage.</p><p>Whether you hit or miss, each creature within 10 feet of the target must make a Dexterity saving throw. Each of these creatures takes 2d8 lightning damage on a failed save, or half as much damage on a successful one.</p><p>The piece of ammunition or weapon then returns to its normal form.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage for both effects of the spell increases by 1d8 for each slot level above 3rd.",
		"spellLists": "Ranger",
		"castingTime": "1 bonus action",
		"range": "Self",
		"components": "V, S",
		"duration": "Concentration, up to 1 minute"
	},
	"LIGHTNING_BOLT": {
		"name": "Lightning Bolt",
		"source": "Player's Handbook",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>A stroke of lightning forming a line of 100 feet long and 5 feet wide blasts out from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 8d6 lightning damage on a failed save, or half as much damage on a successful one.</p><p>The lightning ignites flammable objects in the area that aren’t being worn or carried.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.",
		"spellLists": "Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "Self (100-foot line)",
		"components": "V, S, M (a bit of fur and a rod of amber, crystal, or glass)",
		"duration": "Instantaneous"
	},
	"MAGIC_CIRCLE": {
		"name": "Magic Circle",
		"source": "Player's Handbook",
		"type": "ABJURATION",
		"level": 3,
		"description": "<div><p>You create a 10-foot-radius, 20-foot-tall cylinder of magical energy centered on a point on the ground that you can see within range. Glowing runes appear wherever the cylinder intersects with the floor or other surface.</p><p>Choose one or more of the following types of creatures: celestials, elementals, fey, fiends, or undead. The circle affects a creature of the chosen type in the following ways:</p><ul><li>The creature can’t willingly enter the cylinder by nonmagical means. If the creature tries to use teleportation or interplanar travel to do so, it must first succeed on a Charisma saving throw.</li></ul><ul><li>The creature has disadvantage on attack rolls against targets within the cylinder.</li></ul><ul><li>Targets within the cylinder can’t be charmed, frightened, or possessed by the creature.</li></ul><p>When you cast this spell, you can elect to cause its magic to operate in the reverse direction, preventing a creature of the specified type from leaving the cylinder and protecting targets outside it.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the duration increases by 1 hour for each slot level above 3rd.",
		"spellLists": "Cleric, Paladin, Warlock, Wizard",
		"castingTime": "1 minute",
		"range": "10 feet",
		"components": "V, S, M (holy water or powdered silver and iron worth at least 100 gp, which the spell consumes)",
		"duration": "1 hour"
	},
	"MAJOR_IMAGE": {
		"name": "Major Image",
		"source": "Player's Handbook",
		"type": "ILLUSION",
		"level": 3,
		"description": "<div><p>You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can’t create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte’s stench).</p><p>As long as you are within range of the illusion, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example.</p><p>Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 6th level or higher, the spell lasts until dispelled, without requiring your concentration. In this form it is sometimes considered a different spell, known as Permanent Image.",
		"spellLists": "Bard, Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "120 feet",
		"components": "V, S, M (a bit of fleece)",
		"duration": "Concentration, up to 10 minutes"
	},
	"MASS_HEALING_WORD": {
		"name": "Mass Healing Word",
		"source": "Player's Handbook",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the healing increases by 1d4 for each slot level above 3rd.",
		"spellLists": "Bard (Optional), Cleric",
		"castingTime": "1 bonus action",
		"range": "60 feet",
		"components": "V",
		"duration": "Instantaneous"
	},
	"MELD_INTO_STONE": {
		"name": "Meld into Stone",
		"source": "Player's Handbook",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>You step into a stone object or surface large enough to fully contain your body, melding yourself and all the equipment you carry with the stone for the duration. Using your movement, you step into the stone at a point you can touch. Nothing of your presence remains visible or otherwise detectable by nonmagical senses.</p><p>While merged with the stone, you can’t see what occurs outside it, and any Wisdom (Perception) checks you make to hear sounds outside it are made with disadvantage. You remain aware of the passage of time and can cast spells on yourself while merged in the stone. You can use your movement to leave the stone where you entered it, which ends the spell. You otherwise can’t move.</p><p>Minor physical damage to the stone doesn’t harm you, but its partial destruction or a change in its shape (to the extent that you no longer fit within it) expels you and deals 6d6 bludgeoning damage to you. The stone’s complete destruction (or transmutation into a different substance) expels you and deals 50 bludgeoning damage to you. If expelled, you fall prone in an unoccupied space closest to where you first entered.</p></div>",
		"spellLists": "Cleric, Druid, Ranger (Optional)",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, S",
		"duration": "8 hours"
	},
	"MELFS_MINUTE_METEORS": {
		"name": "Melf's Minute Meteors",
		"source": "Xanathar's Guide to Everything",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>You create six tiny meteors in your space. They float in the air and orbit you for the spell’s duration. When you cast the spell — and as a bonus action on each of your turns thereafter — you can expend one or two of the meteors, sending them streaking toward a point or points you choose within 120 feet of you. Once a meteor reaches its destination or impacts against a solid surface, the meteor explodes. Each creature within 5 feet of the point where the meteor explodes must make a Dexterity saving throw. A creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the number of meteors created increases by two for each slot level above 3rd.",
		"spellLists": "Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "Self",
		"components": "V, S, M (niter, sulfur, and pine tar formed into a bead)",
		"duration": "Concentration, up to 10 minutes"
	},
	"MOTIVATIONAL_SPEECH": {
		"name": "Motivational Speech",
		"source": "Acquisitions Inc.",
		"type": "ENCHANTMENT",
		"level": 3,
		"description": "<div><p>Choose up to five creatures within range that can hear you. For the duration, each affected creature gains 5 temporary hit points and has advantage on Wisdom saving throws. If an affected creature is hit by an attack, it has advantage on the next attack roll it makes. Once an affected creature loses the temporary hit points granted by this spell, the spell ends for that creature.</p><p><strong><em>At Higher Levels:</em></strong> When you cast this spell using a spell slot of 4th level or higher, the temporary hit points increase by 5 for each slot level above 3rd.</p><p><strong><em>Spell Lists:</em></strong> <a href=\"http://dnd5e.wikidot.com/spells:bard\">Bard</a>, <a href=\"http://dnd5e.wikidot.com/spells:cleric\">Cleric</a></p></div>",
		"castingTime": "1 minute",
		"range": "60 feet",
		"components": "V",
		"duration": "1 hour"
	},
	"NONDETECTION": {
		"name": "Nondetection",
		"source": "Player's Handbook",
		"type": "ABJURATION",
		"level": 3,
		"description": "<div><p>For the duration, you hide a target that you touch from divination magic. The target can be a willing creature or a place or an object no larger than 10 feet in any dimension. The target can’t be targeted by any divination magic or perceived through magical scrying sensors.</p></div>",
		"spellLists": "Bard, Ranger, Wizard",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, S, M (a pinch of diamond dust worth 25 gp sprinkled over the target, which the spell consumes)",
		"duration": "8 hours"
	},
	"PHANTOM_STEED": {
		"name": "Phantom Steed",
		"source": "Player's Handbook",
		"type": "ILLUSION",
		"level": 3,
		"description": "<div><p>A Large quasi-real, horselike creature appears on the ground in an unoccupied space of your choice within range. You decide the creature’s appearance, but it is equipped with a saddle, bit, and bridle. Any of the equipment created by the spell vanishes in a puff of smoke if it is carried more than 10 feet away from the steed.</p><p>For the duration, you or a creature you choose can ride the steed. The creature uses the statistics for a riding horse, except it has a speed of 100 feet and can travel 10 miles in an hour, or 13 miles at a fast pace. When the spell ends, the steed gradually fades, giving the rider 1 minute to dismount. The spell ends if you use an action to dismiss it or if the steed takes any damage.</p></div>",
		"spellLists": "Wizard",
		"castingTime": "1 minute",
		"range": "30 feet",
		"components": "V, S",
		"duration": "1 hour"
	},
	"PLANT_GROWTH": {
		"name": "Plant Growth",
		"source": "Player's Handbook",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>This spell channels vitality into plants within a specific area. There are two possible uses for the spell, granting either immediate or long-term benefits.</p><p>If you cast this spell using 1 action, choose a point within range. All normal plants in a 100-foot radius centered on that point become thick and overgrown. A creature moving through the area must spend 4 feet of movement for every 1 foot it moves.</p><p>You can exclude one or more areas of any size within the spell’s area from being affected.</p><p>If you cast this spell over 8 hours, you enrich the land. All plants in a half-mile radius centered on a point within range become enriched for 1 year. The plants yield twice the normal amount of food when harvested.</p></div>",
		"spellLists": "Bard, Druid, Ranger",
		"castingTime": "1 action or 8 hours",
		"range": "150 feet",
		"components": "V, S",
		"duration": "Instantaneous"
	},
	"PROTECTION_FROM_BALLISTICS": {
		"name": "Protection from Ballistics (UA)",
		"source": "Unearthed Arcana 7 - Modern Magic",
		"type": "ABJURATION",
		"level": 3,
		"description": "<div><p>This spell enchants the flesh of the target against the impact of bullets. Until the spell ends, the target has resistance to nonmagical ballistic damage.</p></div>",
		"spellLists": "Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, S, M (a shell casing)",
		"duration": "Concentration, up to 10 minutes"
	},
	"PROTECTION_FROM_ENERGY": {
		"name": "Protection from Energy",
		"source": "Player's Handbook",
		"type": "ABJURATION",
		"level": 3,
		"description": "<div><p>For the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder.</p></div>",
		"spellLists": "Artificer, Cleric, Druid, Ranger, Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, S",
		"duration": "Concentration, up to 1 hour"
	},
	"PSIONIC_BLAST": {
		"name": "Psionic Blast (UA)",
		"source": "Unearthed Arcana 66 - Fighter, Rogue, and Wizard",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>You unleash a destructive wave of mental power in a 30-foot cone. Each creature in the area must make a Dexterity saving throw. On a failed save, a target takes 5d8 force damage, is pushed 20 feet directly away from you, and is knocked prone. On a successful save, a target takes half as much damage and isn’t pushed or knocked prone.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.",
		"spellLists": "Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "Self (30-foot cone)",
		"components": "V",
		"duration": "Instantaneous"
	},
	"PULSE_WAVE": {
		"name": "Pulse Wave",
		"source": "Explorer's Guide to Wildemount",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>You create intense pressure, unleash it in a 30-foot cone, and decide whether the pressure pulls or pushes creatures and objects. Each creature in that cone must make a Constitution saving throw. A creature takes 6d6 force damage on a failed save, or half as much damage on a successful one. And every creature that fails the save is either pulled 15 feet toward you or pushed 15 feet away from you, depending on the choice you made for the spell.</p><p>In addition, unsecured objects that are completely within the cone are likewise pulled or pushed 15 feet.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 and the distance pulled or pushed increases by 5 feet for each slot level above 3rd.",
		"spellLists": "Wizard",
		"castingTime": "1 action",
		"range": "Self (30-foot cone)",
		"components": "V, S",
		"duration": "Instantaneous"
	},
	"REMOVE_CURSE": {
		"name": "Remove Curse",
		"source": "Player's Handbook",
		"type": "ABJURATION",
		"level": 3,
		"description": "<div><p>At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner’s attunement to the object so it can be removed or discarded.</p></div>",
		"spellLists": "Cleric, Paladin, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, S",
		"duration": "Instantaneous"
	},
	"REVIVIFY": {
		"name": "Revivify",
		"source": "Player's Handbook",
		"type": "NECROMANCY",
		"level": 3,
		"description": "<div><p>You touch a creature that has died within the last minute. That creature returns to life with 1 hit point. This spell can’t return to life a creature that has died of old age, nor can it restore any missing body parts.</p></div>",
		"spellLists": "Artificer, Cleric, Druid (Optional), Paladin, Ranger (Optional)",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, S, M (diamonds worth 300 gp, which the spell consumes)",
		"duration": "Instantaneous"
	},
	"SENDING": {
		"name": "Sending",
		"source": "Player's Handbook",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>You send a short message of twenty-five words or less to a creature with which you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately. The spell enables creatures with Intelligence scores of at least 1 to understand the meaning of your message.</p><p>You can send the message across any distance and even to other planes of existence, but if the target is on a different plane than you, there is a 5 percent chance that the message doesn't arrive.</p></div>",
		"spellLists": "Bard, Cleric, Wizard",
		"castingTime": "1 action",
		"range": "Unlimited",
		"components": "V, S, M (a short piece of fine copper wire)",
		"duration": "1 round"
	},
	"SLEET_STORM": {
		"name": "Sleet Storm",
		"source": "Player's Handbook",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>Until the spell ends, freezing rain and sleet fall in a 20-foot-tall cylinder with a 40-foot radius centered on a point you choose within range. The area is heavily obscured, and exposed flames in the area are doused.</p><p>The ground in the area is covered with slick ice, making it difficult terrain. When a creature enters the spell’s area for the first time on a turn or starts its turn there, it must make a Dexterity saving throw. On a failed save, it falls prone.</p><p>If a creature starts its turn in the spell's area and is concentrating on a spell, the creature must make a successful Constitution saving throw against your spell save DC or lose concentration.</p></div>",
		"spellLists": "Druid, Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "120 feet",
		"components": "V, S, M (a pinch of dust and a few drops of water)",
		"duration": "Concentration, up to 1 minute"
	},
	"SLOW": {
		"name": "Slow",
		"source": "Player's Handbook",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>You alter time around up to six creatures of your choice in a 40-foot cube within range. Each target must succeed on a Wisdom saving throw or be affected by this spell for the duration.</p><p>An affected target’s speed is halved, it takes a -2 penalty to AC and Dexterity saving throws, and it can’t use reactions. On its turn, it can use either an action or a bonus action, not both. Regardless of the creature’s abilities or magic items, it can’t make more than one melee or ranged attack during its turn.</p><p>If the creature attempts to cast a spell with a casting time of 1 action, roll a d20. On an 11 or higher, the spell doesn’t take effect until the creature’s next turn, and the creature must use its action on that turn to complete the spell. If it can’t, the spell is wasted.</p><p>A creature affected by this spell makes another Wisdom saving throw at the end of each of its turns. On a successful save, the effect ends for it.</p></div>",
		"spellLists": "Bard (Optional), Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "120 feet",
		"components": "V, S, M (a drop of molasses)",
		"duration": "Concentration, up to 1 minute"
	},
	"SPEAK_WITH_DEAD": {
		"name": "Speak with Dead",
		"source": "Player's Handbook",
		"type": "NECROMANCY",
		"level": 3,
		"description": "<div><p>You grant the semblance of life and intelligence to a corpse of your choice within range, allowing it to answer the questions you pose. The corpse must still have a mouth and can’t be undead. The spell fails if the corpse was the target of this spell within the last 10 days.</p><p>Until the spell ends, you can ask the corpse up to five questions. The corpse knows only what it knew in life, including the languages it knew. Answers are usually brief, cryptic, or repetitive, and the corpse is under no compulsion to offer a truthful answer if you are hostile to it or it recognizes you as an enemy. This spell doesn’t return the creature’s soul to its body, only its animating spirit. Thus, the corpse can’t learn new information, doesn’t comprehend anything that has happened since it died, and can’t speculate about future events.</p></div>",
		"spellLists": "Bard, Cleric, Wizard (Optional)",
		"castingTime": "1 action",
		"range": "10 feet",
		"components": "V, S, M (burning incense)",
		"duration": "10 minutes"
	},
	"SPEAK_WITH_PLANTS": {
		"name": "Speak with Plants",
		"source": "Player's Handbook",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>You imbue plants within 30 feet of you with limited sentience and animation, giving them the ability to communicate with you and follow your simple commands. You can question plants about events in the spell’s area within the past day, gaining information about creatures that have passed, weather, and other circumstances.</p><p>You can also turn difficult terrain caused by plant growth (such as thickets and undergrowth) into ordinary terrain that lasts for the duration. Or you can turn ordinary terrain where plants are present into difficult terrain that lasts for the duration, causing vines and branches to hinder pursuers, for example.</p><p>Plants might be able to perform other tasks on your behalf, at the DM’s discretion. The spell doesn’t enable plants to uproot themselves and move about, but they can freely move branches, tendrils, and stalks.</p><p>If a plant creature is in the area, you can communicate with it as if you share a common language, but you gain no magical ability to influence it.</p><p>This spell can cause the plants created by the entangle spell to release a restrained creature.</p></div>",
		"spellLists": "Bard, Druid, Ranger",
		"castingTime": "1 action",
		"range": "Self (30-foot radius)",
		"components": "V, S",
		"duration": "10 minutes"
	},
	"SPIRIT_GUARDIANS": {
		"name": "Spirit Guardians",
		"source": "Player's Handbook",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You call forth spirits to protect you. They flit around you to a distance of 15 feet for the duration. If you are good or neutral, their spectral form appears angelic or fey (your choice). If you are evil, they appear fiendish.</p><p>When you cast this spell, you can designate any number of creatures you can see to be unaffected by it. An affected creature’s speed is halved in the area, and when the creature enters the area for the first time on a turn or starts its turn there, it must make a Wisdom saving throw. On a failed save, the creature takes 3d8 radiant damage (if you are good or neutral) or 3d8 necrotic damage (if you are evil). On a successful save, the creature takes half as much damage.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.",
		"spellLists": "Cleric",
		"castingTime": "1 action",
		"range": "Self (15-foot-radius)",
		"components": "V, S, M (a holy symbol)",
		"duration": "Concentration, up to 10 minutes"
	},
	"SPIRIT_SHROUD": {
		"name": "Spirit Shroud",
		"source": "Tasha's Cauldron of Everything",
		"type": "NECROMANCY",
		"level": 3,
		"description": "<div><p>You call forth spirits of the dead, which flit around you for the spell’s duration. The spirits are intangible and invulnerable.</p><p>Until the spell ends, any attack you make deals 1d8 extra damage when you hit a creature within 10 feet of you. This damage is radiant, necrotic, or cold (your choice when you cast the spell). Any creature that takes this damage can’t regain hit points until the start of your next turn.</p><p>In addition, any creature of your choice that you can see that starts its turn within 10 feet of you has its speed reduced by 10 feet until the start of your next turn.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for every two slot levels above 3rd.",
		"spellLists": "Cleric (Optional), Paladin (Optional), Warlock (Optional), Wizard (Optional)",
		"castingTime": "1 bonus action",
		"range": "Self",
		"components": "V, S",
		"duration": "Concentration, up to 1 minute"
	},
	"STINKING_CLOUD": {
		"name": "Stinking Cloud",
		"source": "Player's Handbook",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration.</p><p>Each creature that is completely within the cloud at the start of its turn must make a Constitution saving throw against poison. On a failed save, the creature spends its action that turn retching and reeling. Creatures that don’t need to breathe or are immune to poison automatically succeed on this saving throw.</p><p>A moderate wind (at least 10 miles per hour) disperses the cloud after 4 rounds. A strong wind (at least 20 miles per hour) disperses it after 1 round.</p></div>",
		"spellLists": "Bard, Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "90 feet",
		"components": "V, S, M (a rotten egg or several skunk cabbage leaves)",
		"duration": "Concentration, up to 1 minute"
	},
	"SUMMON_FEY": {
		"name": "Summon Fey",
		"source": "Tasha's Cauldron of Everything",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You call forth a fey spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Fey Spirit stat block. When you cast the spell, choose a mood. Fuming, Mirthful, or Tricksy. The creature resembles a fey creature of your choice marked by the chosen mood, which determines one of the traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.</p><p>The creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don’t issue any, it takes the Dodge action and uses its move to avoid danger.</p><p><strong><em>At Higher Levels.</em></strong> When you cast this spell using a spell slot of 4th level or higher, use the higher level wherever the spell’s level appears in the stat block.</p><p><strong><em>Spell Lists.</em></strong> <a href=\"/spells:druid\">Druid (Optional)</a>, <a href=\"/spells:ranger\">Ranger (Optional)</a>, <a href=\"/spells:warlock\">Warlock (Optional)</a>, <a href=\"/spells:wizard\">Wizard (Optional)</a></p><table><tbody><tr><th colspan=\"6\">Fey Spirit</th></tr><tr><td colspan=\"6\"><em>Small fey</em></td></tr><tr><td colspan=\"6\"><strong>Armor Class:</strong> 12 + the level of the spell (natural armor)</td></tr><tr><td colspan=\"6\"><strong>Hit Points:</strong> 30 + 10 for each spell level above 3rd</td></tr><tr><td colspan=\"6\"><strong>Speed:</strong> 40 ft.</td></tr><tr><th>STR</th><th>DEX</th><th>CON</th><th>INT</th><th>WIS</th><th>CHA</th></tr><tr><td>13 (+1)</td><td>16 (+3)</td><td>14 (+2)</td><td>14 (+2)</td><td>11 (+0)</td><td>16 (+3)</td></tr><tr><td colspan=\"6\"><strong>Condition Immunities:</strong> charmed</td></tr><tr><td colspan=\"6\"><strong>Senses:</strong> darkvision 60 ft., passive Perception 10</td></tr><tr><td colspan=\"6\"><strong>Languages:</strong> Sylvan, understands the languages you speak</td></tr><tr><td colspan=\"6\"><strong>Challenge:</strong> —</td></tr><tr><td colspan=\"6\"><strong>Proficiency Bonus:</strong> equals your bonus</td></tr><tr><th colspan=\"6\">Actions</th></tr><tr><td colspan=\"6\"><strong><em>Multiattack.</em></strong> The Fey makes a number of attacks equal to half this spell’s level (rounded down).</td></tr><tr><td colspan=\"6\"><strong><em>Shortsword.</em></strong> <em>Melee Weapon Attack:</em> your spell attack modifier to hit, reach 5 ft., one target. <em>Hit:</em> 1d6 + 3 + the spell’s level piercing damage + 1d6 force damage.</td></tr><tr><th colspan=\"6\">Bonus Actions</th></tr><tr><td colspan=\"6\"><strong><em>Fey Step.</em></strong> The fey magically teleports up to 30 feet to an unoccupied space it can see. Then one of the following effects occurs, based on the fey’s chosen mood.</td></tr><tr><td colspan=\"6\"><strong><em>Fuming.</em></strong> The fey has advantage on the next attack roll it makes before the end of this turn.</td></tr><tr><td colspan=\"6\"><strong><em>Mirthful.</em></strong> The fey can force one creature it can see within 10 feet of it to make a Wisdom saving throw against your spell save DC. Unless the save succeeds, the target is charmed by you and the fey for 1 minute or until the target takes any damage.</td></tr><tr><td colspan=\"6\"><strong><em>Tricksy.</em></strong> The fey can fill a 5-foot cube within 5 feet of it with magical darkness, which lasts until the end of its next turn.</td></tr></tbody></table></div>",
		"castingTime": "1 action",
		"range": "90 feet",
		"components": "V, S, M (a gilded flower worth at least 300 gp)",
		"duration": "Concentration, up to 1 hour"
	},
	"SUMMON_LESSER_DEMONS": {
		"name": "Summon Lesser Demons",
		"source": "Xanathar's Guide to Everything",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You utter foul words, summoning demons from the chaos of the Abyss. Roll on the following table to determine what appears.</p><table><tbody><tr><th>d6</th><th>Demons Summoned</th></tr><tr><td>1-2</td><td>Two demons of challenge rating 1 or lower</td></tr><tr><td>3-4</td><td>Four demons of challenge rating 1/2 or lower</td></tr><tr><td>5-6</td><td>Eight demons of challenge rating 1/4 or lower</td></tr></tbody></table><p>The DM chooses the demons, such as manes or dretches, and you choose the unoccupied spaces you can see within range where they appear. A summoned demon disappears when it drops to 0 hit points or when the spell ends.</p><p>The demons are hostile to all creatures, including you. Roll initiative for the summoned demons as a group, which has its own turns. The demons pursue and attack the nearest non-demons to the best of their ability.</p><p>As part of casting the spell, you can form a circle on the ground with the blood used as a material component. The circle is large enough to encompass your space. While the spell lasts, the summoned demons can't cross the circle or harm it, and they can't target anyone within it. Using the material component in this manner consumes it when the spell ends.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 6th or 7th level, you summon twice as many demons. If you cast it using a spell slot of 8th or 9th level, you summon three times as many demons.",
		"spellLists": "Warlock, Wizard",
		"castingTime": "1 action",
		"range": "60 feet",
		"components": "V, S, M (a vial of blood from a humanoid killed within the past 24 hours)",
		"duration": "Concentration, up to 1 hour"
	},
	"SUMMON_SHADOWSPAWN": {
		"name": "Summon Shadowspawn",
		"source": "Tasha's Cauldron of Everything",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You call forth a shadowy spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Shadow Spirit stat block. When you cast the spell, choose an emotion: Fury, Despair, or Fear. The creature resembles a misshapen biped marked by the chosen emotion, which determines certain traits in its stat block. The creature disappears when it drop to 0 hit points or when the spell ends.</p><p>The creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after your. It obeys your verbal commands (no action required by you). If you don’t issue any, it takes the Dodge action and it uses its move to avoid danger.</p><p><strong><em>At Higher Levels.</em></strong> When you cast the spell using a spell slot of 4th level or higher, use the higher level wherever the spell’s level appears on the stat block.</p><p><strong><em>Spell Lists.</em></strong> <a href=\"/spells:warlock\">Warlock (Optional)</a>, <a href=\"/spells:wizard\">Wizard (Optional)</a></p><table><tbody><tr><th colspan=\"6\">Shadow Spirit</th></tr><tr><td colspan=\"6\"><em>Medium monstrosity</em></td></tr><tr><td colspan=\"6\"><strong>Armor Class:</strong> 11 + the level of the spell (natural armor)</td></tr><tr><td colspan=\"6\"><strong>Hit Points:</strong> 35 + 15 for each level of the spell above 3rd</td></tr><tr><td colspan=\"6\"><strong>Speed:</strong> 40 ft.</td></tr><tr><th>STR</th><th>DEX</th><th>CON</th><th>INT</th><th>WIS</th><th>CHA</th></tr><tr><td>13 (+1)</td><td>16 (+3)</td><td>15 (+2)</td><td>4 (−3)</td><td>10 (+0)</td><td>16 (+3)</td></tr><tr><td colspan=\"6\"><strong>Damage Resistances:</strong> necrotic</td></tr><tr><td colspan=\"6\"><strong>Condition Immunities:</strong> frightened</td></tr><tr><td colspan=\"6\"><strong>Senses:</strong> darkvision 120 ft., passive Perception 10</td></tr><tr><td colspan=\"6\"><strong>Languages:</strong> understands the languages you speak</td></tr><tr><td colspan=\"6\"><strong>Challenge:</strong> —</td></tr><tr><td colspan=\"6\"><strong>Proficiency Bonus:</strong> equals your bonus</td></tr><tr><td colspan=\"6\"><strong><em>Terror Frenzy (Fury Only).</em></strong> The spirit has advantage on attack rolls against frightened creatures.</td></tr><tr><td colspan=\"6\"><strong><em>Weight of Sorrow (Despair Only).</em></strong> Any creature, other than you, that starts its turn within 5 feet of the spirit has its speed reduced by 20 feet until the start of that creature’s next turn.</td></tr><tr><th colspan=\"6\">Actions</th></tr><tr><td colspan=\"6\"><strong><em>Multiattack.</em></strong> The spirit makes a number of attacks equal to half this spell’s level (rounded down).</td></tr><tr><td colspan=\"6\"><strong><em>Chilling Hand.</em></strong> <em>Melee Weapon Attack:</em> your spell attack modifier to hit, reach 5 ft., one target. <em>Hit:</em> 1d12 + 3 + the spell’s level cold damage.</td></tr><tr><td colspan=\"6\"><strong><em>Dreadful Scream (1/Day).</em></strong> The spirit screams. Each creature within 30 feet of it must succeed on a Wisdom saving throw against your spell save DC or be frightened of the spirit for 1 minute. The frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.</td></tr><tr><th colspan=\"6\">Bonus Action</th></tr><tr><td colspan=\"6\"><strong><em>Shadow Stealth (Fear Only).</em></strong> While in dim light or darkness, the spirit takes the Hide action.</td></tr></tbody></table></div>",
		"castingTime": "1 action",
		"range": "90 feet",
		"components": "V, S, M (tears inside a crystal vial worth at least 300 gp)",
		"duration": "Concentration, up to 1 hour"
	},
	"SUMMON_UNDEAD": {
		"name": "Summon Undead",
		"source": "Tasha's Cauldron of Everything",
		"type": "NECROMANCY",
		"level": 3,
		"description": "<div><p>You call forth an undead spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Undead Spirit stat block. When you cast the spell, choose the creature’s form: Ghostly, Putrid, or Skeletal. The spirit resembles an undead creature with the chosen form, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.</p><p>The creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don’t issue any, it takes the Dodge action and uses its move to avoid danger.</p><p><strong><em>At Higher Levels.</em></strong> When you cast this spell using a spell slot of 4th level or higher, use the higher level wherever the spell’s level appears in the stat block.</p><p><strong><em>Spell Lists.</em></strong> <a href=\"/spells:warlock\">Warlock (Optional)</a>, <a href=\"/spells:wizard\">Wizard (Optional)</a></p><table><tbody><tr><th colspan=\"6\">Undead Spirit</th></tr><tr><td colspan=\"6\"><em>Medium undead</em></td></tr><tr><td colspan=\"6\"><strong>Armor Class:</strong> 11 + the level of the spell (natural armor)</td></tr><tr><td colspan=\"6\"><strong>Hit Points:</strong> 30 (Ghostly and Putrid only) or 20 (Skeletal only) + 10 for each level of the spell above 3rd</td></tr><tr><td colspan=\"6\"><strong>Speed:</strong> 30 ft., fly 40 ft. (hover) (Ghostly only)</td></tr><tr><th>STR</th><th>DEX</th><th>CON</th><th>INT</th><th>WIS</th><th>CHA</th></tr><tr><td>12 (+1)</td><td>16 (+3)</td><td>15 (+2)</td><td>4 (−3)</td><td>10 (+0)</td><td>9 (−1)</td></tr><tr><td colspan=\"6\"><strong>Damage Immunities:</strong> necrotic, poison</td></tr><tr><td colspan=\"6\"><strong>Condition:</strong> Immunities exhaustion, frightened, paralyzed, poisoned</td></tr><tr><td colspan=\"6\"><strong>Senses:</strong> darkvision 60 ft., passive Perception 10</td></tr><tr><td colspan=\"6\"><strong>Languages:</strong> understands the languages you speak</td></tr><tr><td colspan=\"6\"><strong>Challenge:</strong> —</td></tr><tr><td colspan=\"6\"><strong>Proficiency Bonus:</strong> equals your bonus</td></tr><tr><td colspan=\"6\"><strong><em>Festering Aura (Putrid Only).</em></strong> Any creature, other than you, that starts its turn within 5 feet of the spirit must succeed on a Constitution saving throw against your spell save DC or be poisoned until the start of its next turn.</td></tr><tr><td colspan=\"6\"><strong><em>Incorporeal Passage (Ghostly Only).</em></strong> The spirit can move through other creatures and objects as if they were difficult terrain. If it ends its turn inside an objects, it is shunted to the nearest unoccupied space and takes 1d10 force damage for every 5 feet traveled.</td></tr><tr><th colspan=\"6\">Actions</th></tr><tr><td colspan=\"6\"><strong><em>Multiattack.</em></strong> The spirit makes a number of attacks equal to half this spell’s level (rounded down).</td></tr><tr><td colspan=\"6\"><strong><em>Deathly Touch (Ghostly Only).</em></strong> <em>Melee Weapon Attack:</em> your spell attack modifier to hit, reach 5 ft., one creature. <em>Hit:</em> 1d8 + 3 + the spell’s level necrotic damage, and the creature must succeed on a Wisdom saving throw against your spell save DC or be frightened of the undead until the end of the target’s next turn.</td></tr><tr><td colspan=\"6\"><strong><em>Grave Bolt (Skeletal Only).</em></strong> <em>Ranged Spell Attack:</em> your spell attack modifier to hit, range 150 ft., one target. <em>Hit:</em> 2d4 + 3 + the spell’s level necrotic damage.</td></tr><tr><td colspan=\"6\"><strong><em>Rotting Claw (Putrid Only).</em></strong> <em>Melee Weapon Attack:</em> your spell attack modifier to hit, reach 5 ft., one target. <em>Hit:</em> 1d6 + 3 + the spell’s level slashing damage. If the target is poisoned, it must succeed on a Constitution saving throw against your spell save DC or be paralyzed until the end of its next turn.</td></tr></tbody></table></div>",
		"castingTime": "1 action",
		"range": "90 feet",
		"components": "V, S, M (a gilded skull worth at least 300 gp)",
		"duration": "Concentration, up to 1 hour"
	},
	"SUMMON_WARRIOR_SPIRIT": {
		"name": "Summon Warrior Spirit (UA)",
		"source": "Unearthed Arcana 85 - Wonders of the Multiverse",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You call forth a warrior spirit from the legendary <a href=\"http://dnd5e.wikidot.com/wondrous-items:deck-of-many-things\">Deck of Many Things</a>. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Warrior Spirit stat block. When you cast the spell, choose a type of warrior: barbarian, fighter, or monk. The warrior resembles a humanoid armed appropriately to the chosen class, which determines certain traits in its stat block. The warrior disappears when it drops to 0 hit points or when the spell ends.</p><p>The warrior is an ally to you and your companions. In combat, the warrior shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don’t issue any, it takes the Dodge action and uses its move to avoid danger.</p><p><strong><em>At Higher Levels.</em></strong> When you cast this spell using a spell slot of 4th level or higher, the creature assumes the higher level for that casting wherever it uses the spell’s level in its stat block.</p><p><strong><em>Spell Lists.</em></strong> <a href=\"http://dnd5e.wikidot.com/spells:sorcerer,\">Sorcerer</a>, <a href=\"http://dnd5e.wikidot.com/spells:warlock\">Warlock</a>, <a href=\"http://dnd5e.wikidot.com/spells:wizard\">Wizard</a></p><table><tbody><tr><th colspan=\"6\">Warrior Spirit</th></tr><tr><td colspan=\"6\"><em>Medium Undead</em></td></tr><tr><td colspan=\"6\"><strong>Armor Class:</strong> 13 + the level of the spell + 2 (Fighter only)</td></tr><tr><td colspan=\"6\"><strong>Hit Points:</strong> 30 (Babarian and Fighter only) or 20 (Monk only) + 10 for each spell level above 3rd</td></tr><tr><td colspan=\"6\"><strong>Speed:</strong> 30 ft., 40 ft. (Monk only)</td></tr><tr><th>STR</th><th>DEX</th><th>CON</th><th>INT</th><th>WIS</th><th>CHA</th></tr><tr><td>16 (+3)</td><td>16 (+3)</td><td>14 (+2)</td><td>10 (+0)</td><td>16 (+3)</td><td>9 (-1)</td></tr><tr><td colspan=\"6\"><strong>Saving Throws:</strong> Str +3, Dex +3</td></tr><tr><td colspan=\"6\"><strong>Damage Resistances:</strong> poison</td></tr><tr><td colspan=\"6\"><strong>Condition Immunities:</strong> charmed, poisoned</td></tr><tr><td colspan=\"6\"><strong>Senses:</strong> passive Perception 13</td></tr><tr><td colspan=\"6\"><strong>Languages:</strong> Common, understands the languages you speak</td></tr><tr><td colspan=\"6\"><strong>Challenge:</strong> —</td></tr><tr><td colspan=\"6\"><strong>Proficiency Bonus:</strong> equals your bonus</td></tr><tr><th colspan=\"6\">Actions</th></tr><tr><td colspan=\"6\"><strong><em>Multiattack.</em></strong> The warrior makes a number of attacks equal to half this spell’s level (rounded down).</td></tr><tr><td colspan=\"6\"><strong><em>Reckless Strike (Barbarian Only).</em></strong> <em>Melee Weapon Attack:</em> your spell attack modifier to hit (with advantage), reach 5 ft., one target. <em>Hit:</em> 1d12 + 3 + the spell’s level slashing damage, and attacks made against the warrior until the start of its next turn are made with advantage.</td></tr><tr><td colspan=\"6\"><strong><em>Rallying Strike (Fighter Only).</em></strong> <em>Melee or Ranged Weapon Attack:</em> your spell attack modifier to hit, reach 5 ft., or range 20/60 ft., one target. <em>Hit:</em> 1d6 + 3 + the spell’s level piercing damage, and the warrior can choose another creature it can see within 20 feet of itself. The chosen creature gains 1d6 temporary hit points.</td></tr><tr><td colspan=\"6\"><strong><em>Unarmed Strike (Monk Only).</em></strong> <em>Melee Weapon Attack:</em> your spell attack modifier to hit, reach 5 ft., one target. <em>Hit:</em> 1d4 + 3 + the spell’s level bludgeoning damage, and the target must succeed on a Strength saving throw against your spell save DC or be knocked prone.</td></tr><tr><th colspan=\"6\">Bonus Actions</th></tr><tr><td colspan=\"6\"><strong><em>Flurry of Blows (Monk Only).</em></strong> The monk makes one Unarmed Strike attack.</td></tr></tbody></table></div>",
		"castingTime": "1 action",
		"range": "90 feet",
		"components": "V, S, M (a gilded playing card depicting a knight worth at least 300 gp)",
		"duration": "Concentration, up to 1 hour"
	},
	"THUNDER_STEP": {
		"name": "Thunder Step",
		"source": "Xanathar's Guide to Everything",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You teleport yourself to an unoccupied space you can see within range. Immediately after you disappear, a thunderous boom sounds, and each creature within 10 feet of the space you left must make a Constitution saving throw, taking 3d10 thunder damage on a failed save, or half as much damage on a successful one. The thunder can be heard from up to 300 feet away.</p><p>You can bring along objects as long as their weight doesn’t exceed what you can carry. You can also teleport one willing creature of your size or smaller who is carrying gear up to its carrying capacity. The creature must be within 5 feet of you when you cast this spell, and there must be an unoccupied space within 5 feet of your destination space for the creature to appear in; otherwise, the creature is left behind.</p><p><strong><em>At Higher Levels.</em></strong> When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d10 for each slot level above 3rd.</p><p><strong>Spell lists.</strong> <a href=\"http://dnd5e.wikidot.com/spells:sorcerer\">Sorcerer</a>, <a href=\"http://dnd5e.wikidot.com/spells:warlock\">Warlock</a>, <a href=\"http://dnd5e.wikidot.com/spells:wizard\">Wizard</a></p></div>",
		"castingTime": "1 action",
		"range": "90 ft",
		"components": "V",
		"duration": "Instantaneous"
	},
	"TIDAL_WAVE": {
		"name": "Tidal Wave",
		"source": "Xanathar's Guide to Everything",
		"type": "CONJURATION",
		"level": 3,
		"description": "<div><p>You conjure up a wave of water that crashes down on an area within range. The area can be up to 30 feet long, up to 10 feet wide, and up to 10 feet tall. Each creature in that area must make a Dexterity saving throw. On a failure, a creature takes 4d8 bludgeoning damage and is knocked prone. On a success, a creature takes half as much damage and isn’t knocked prone. The water then spreads out across the ground in all directions, extinguishing unprotected flames in its area and within 30 feet of it.</p></div>",
		"spellLists": "Druid, Wizard",
		"castingTime": "1 action",
		"range": "120 feet",
		"components": "V, S, M (a drop of water)",
		"duration": "Instantaneous"
	},
	"TINY_SERVANT": {
		"name": "Tiny Servant",
		"source": "Xanathar's Guide to Everything",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>You touch one Tiny, nonmagical object that isn’t attached to another object or a surface and isn’t being carried by another creature. The target animates and sprouts little arms and legs, becoming a creature under your control until the spell ends or the creature drops to 0 hit points. See the stat block for its statistics.</p><p>As a bonus action, you can mentally command the creature if it is within 120 feet of you. (If you control multiple creatures with this spell, you can command any or all of them at the same time, issuing the same command to each one.) You decide what action the creature will take and where it will move during its next turn, or you can issue a simple, general command, such as to fetch a key, stand watch, or stack some books. If you issue no commands, the servant does nothing other than defend itself against hostile creatures. Once given an order, the servant continues to follow that order until its task is complete.</p><p>When the creature drops to 0 hit points, it reverts to its original form, and any remaining damage carries over to that form.</p><p><strong><em>At Higher Levels.</em></strong> When you cast this spell using a spell slot of 4th level or higher, you can animate two additional objects for each slot level above 3rd.</p><p><strong><em>Spell Lists.</em></strong> <a href=\"http://dnd5e.wikidot.com/spells:wizard\">Wizard</a>, <a href=\"http://dnd5e.wikidot.com/spells:artificer\">Artificer</a></p><table><tbody><tr><th colspan=\"6\">Tiny Servant</th></tr><tr><td colspan=\"6\"><em>Tiny Construct</em></td></tr><tr><td colspan=\"6\"><strong>Armor Class:</strong> 15 (natural armor)</td></tr><tr><td colspan=\"6\"><strong>Hit Points:</strong> 10 (4d4)</td></tr><tr><td colspan=\"6\"><strong>Speed:</strong> 30ft., climb 30 ft.</td></tr><tr><th>STR</th><th>DEX</th><th>CON</th><th>INT</th><th>WIS</th><th>CHA</th></tr><tr><td>4 (-3)</td><td>16 (+3)</td><td>10 (0)</td><td>2 (-4)</td><td>10 (+0)</td><td>1 (-5)</td></tr><tr><td colspan=\"6\"><strong>Damage Immunities</strong> poison, psychic</td></tr><tr><td colspan=\"6\"><strong>Condition Immunities:</strong> blinded, charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned</td></tr><tr><td colspan=\"6\"><strong>Senses:</strong> blindsight 60 ft. (blind beyond this radius), passive Perception 10</td></tr><tr><td colspan=\"6\"><strong>Languages:</strong> —</td></tr><tr><td colspan=\"6\"><strong>Challenge:</strong> —</td></tr><tr><th colspan=\"6\">Actions</th></tr><tr><td colspan=\"6\"><strong><em>Slam.</em></strong> Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 5 (1d4 + 3) bludgeoning damage.</td></tr></tbody></table></div>",
		"castingTime": "1 minute",
		"range": "Touch",
		"components": "V, S",
		"duration": "8 hours"
	},
	"TONGUES": {
		"name": "Tongues",
		"source": "Player's Handbook",
		"type": "DIVINATION",
		"level": 3,
		"description": "<div><p>This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says.</p></div>",
		"spellLists": "Bard, Cleric, Sorcerer, Warlock, Wizard",
		"castingTime": "1 action",
		"range": "Touch",
		"components": "V, M (a small clay model of a ziggurat)",
		"duration": "1 hour"
	},
	"VAMPIRIC_TOUCH": {
		"name": "Vampiric Touch",
		"source": "Player's Handbook",
		"type": "NECROMANCY",
		"level": 3,
		"description": "<div><p>The touch of your shadow-wreathed hand can siphon force from others to heal your wounds. Make a melee spell attack against a creature within your reach. On a hit, the target takes 3d6 necrotic damage, and you regain hit points equal to half the amount of necrotic damage dealt. Until the spell ends, you can make the attack again on each of your turns as an action.</p></div>",
		"higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.",
		"spellLists": "Sorcerer, Sorcerer (Optional), Wizard",
		"castingTime": "1 action",
		"range": "Self",
		"components": "V, S",
		"duration": "Concentration, up to 1 minute"
	},
	"WALL_OF_SAND": {
		"name": "Wall of Sand",
		"source": "Xanathar's Guide to Everything",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>You conjure up a wall of swirling sand on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 10 feet thick, and it vanishes when the spell ends. It blocks line of sight but not movement. A creature is blinded while in the wall’s space and must spend 3 feet of movement for every 1 foot it moves there.</p></div>",
		"spellLists": "Wizard",
		"castingTime": "1 action",
		"range": "90 feet",
		"components": "V, S, M (a handful of sand)",
		"duration": "Concentration, up to 10 minutes"
	},
	"WALL_OF_WATER": {
		"name": "Wall of Water",
		"source": "Xanathar's Guide to Everything",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>You conjure up a wall of water on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 1 foot thick, or you can make a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall vanishes when the spell ends. The wall’s space is difficult terrain.</p><p>Any ranged weapon attack that enters the wall’s space has disadvantage on the attack roll, and fire damage is halved if the fire effect passes through the wall to reach its target. Spells that deal cold damage that pass through the wall cause the area of the wall they pass through to freeze solid (at least a 5-foot square section is frozen). Each 5-foot-square frozen section has AC 5 and 15 hit points. Reducing a frozen section to 0 hit points destroys it. When a section is destroyed, the wall’s water doesn’t fill it.</p></div>",
		"spellLists": "Druid, Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "60 feet",
		"components": "V, S, M (a drop of water)",
		"duration": "Concentration, up to 10 minutes"
	},
	"WATER_BREATHING": {
		"name": "Water Breathing",
		"source": "Player's Handbook",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>This spell grants up to ten willing creatures you can see within range the ability to breathe underwater until the spell ends. Affected creatures also retain their normal mode of respiration.</p></div>",
		"spellLists": "Artificer, Druid, Ranger, Sorcerer, Wizard",
		"castingTime": "1 action",
		"range": "30 feet",
		"components": "V, S, M (a short reed or piece of straw)",
		"duration": "24 hours"
	},
	"WATER_WALK": {
		"name": "Water Walk",
		"source": "Player's Handbook",
		"type": "TRANSMUTATION",
		"level": 3,
		"description": "<div><p>This spell grants the ability to move across any liquid surface – such as water, acid, mud, snow, quicksand, or lava – as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat). Up to ten willing creatures you can see within range gain this ability for the duration.</p><p>If you target a creature submerged in a liquid, the spell carries the target to the surface of the liquid at a rate of 60 feet per round.</p></div>",
		"spellLists": "Artificer, Cleric, Druid, Ranger, Sorcerer",
		"castingTime": "1 action",
		"range": "30 feet",
		"components": "V, S, M (a piece of cork)",
		"duration": "1 hour"
	},
	"WIND_WALL": {
		"name": "Wind Wall",
		"source": "Player's Handbook",
		"type": "EVOCATION",
		"level": 3,
		"description": "<div><p>A wall of strong wind rises from the ground at a point you choose within range. You can make the wall up to 50 feet long, 15 feet high, and 1 foot thick. You can shape the wall in any way you choose so long as it makes one continuous path along the ground. The wall lasts for the duration.</p><p>When the wall appears, each creature within its area must make a Strength saving throw. A creature takes 3d8 bludgeoning damage on a failed save, or half as much damage on a successful one.</p><p>The strong wind keeps fog, smoke, and other gases at bay. Small or smaller flying creatures or objects can’t pass through the wall. Loose, lightweight materials brought into the wall fly upward. Arrows, bolts, and other ordinary projectiles launched at targets behind the wall are deflected upward and automatically miss. (Boulders hurled by giants or siege engines, and similar projectiles, are unaffected.) Creatures in gaseous form can’t pass through it.</p></div>",
		"spellLists": "Druid, Ranger",
		"castingTime": "1 action",
		"range": "120 feet",
		"components": "V, S, M (a tiny fan and a feather of exotic origin)",
		"duration": "Concentration, up to 1 minute"
	}
}